---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.BaseOffset
source: html/23ab35c2-d143-4df1-0bf1-94fb05d5e870.htm
---
# Autodesk.Revit.DB.Mechanical.Space.BaseOffset Property

Get or set the Base Offset of the Space.

## Syntax (C#)
```csharp
public double BaseOffset { get; set; }
```

## Remarks
This property is used to get or set the Base Offset of the Space.